Revit 2026 API

# MullionTypeSetErase Method

---

Removes a specified mullion type from the set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	MullionType item
)
```
```vb
Public Overridable Function Erase (
	item As MullionType
) As Integer
```
```cpp
public:
virtual int Erase(
	MullionType^ item
)
```
```fsharp
abstract Erase :
        item : MullionType -> int
override Erase :
        item : MullionType -> int
```

#### Parameters

item MullionType
    The mullion type to be erased.

#### Return Value

Int32The number of mullion types that were erased from the set.

#### Reference

MullionTypeSet Class

Autodesk.Revit.DB Namespace